# log(12, 2)
# Ответ: 3.5
#
# 15*4
# Ответ: 60
#
# 60/8
# Ответ: 7.5
#
# (8 + 12) * 50
# Ответ: 1000

# При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 15 символов и содержащий только символы из 12-символьного набора: А, В, C, D, Е, F, G, H, К, L, M, N.
# В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт.
# При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит.
# Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего отведено 12 байт на одного пользователя.
# Определите объём памяти (в байтах), необходимый для хранения сведений о 50 пользователях.
# В ответе запишите только целое число — количество байт.

# РЕШАТЬ В КОНСОЛИ!!!!!!!!!!!!!!!!!