x = 3 * 343**8 + 5 * 49**12 + 7**15 - 49
print(x)
s = bin(x)[2:]
print(s.count('1'))

# Сколько единиц содержится в двоичной записи значения выражения: 4**2020 + 2**2017 – 15?